#include <iostream>

using namespace std;

int main()
{
	// 이름 짓기의 문법
	// 
	// - 의미 있는 이름을 지어라.
	// 
	// 1. 글자와 숫자의 조합으로 만들 수 있다.단, 글자 형태의 문자가 맨 앞글자여야 한다.
	// 2. 대, 소문자를 정확히 가려서 표현한다.
	// 3. 프로그래밍 언어에서 제공하는 키워드로는 이름을 지을 수 없다.
	// 4. 특수 기호가 이름에 위치할 수 없다. 단, _는 허용한다.
	// 5. 같은 중괄호 안에서 재정의 할 수 없다.


	// 표기법 : 변수 이름을 지을 때, 한 번에 어떤 형식인지를 파악하기 위함.

	//1. 헝가리안 표기법 : 변수 이름 앞에 자료 타입을 의미하는 알파벳을 기입
	//	ex) int iHp;

	//2. 카멜 표기법 : 낙타의 혹이 있는 것처럼 단어와 단어 사이의 첫 글자를 대문자로 표기
	//	ex)  int playerHp; 

	//3. 파스칼 표기법 : 단어의 첫 글자를 무조건 대문자로 표기
	//	ex)  int PlayerHp;

	//4. 언더바 표기법 : 변수 이름에는 잘 사용하지 않음, 대개 함수의 이름이나 매개 변수에 붙이는 용도
	//	ex)  void Input_Data(int _iData);

	///////////////////////////////////////////////////////////////////////////////




	return 0;
}